java-test-samples/apigw-lambda-ddb/load-test/load-test-static-data.yml
config:
  phases:
    - duration: 60
      arrivalRate: 100
  payload:
    path: "tickets-static-data.csv"
    fields:
      - "userId"
      - "description"

scenarios:
  - name: "Create Products"
    flow:
      - post:
          url: "/ticket"
          json:
            userId: "{{ userId }}"
            description: "{{ description }}"